garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1769.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2TMR" edc:desc="8-bit period timer" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T2TMR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x1A">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR2" edc:desc="" edc:mask="0xff" edc:name="TMR2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2PR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="T2PR" edc:nzwidth="8" edc:por="11111111" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x1B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PR2"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR2" edc:desc="" edc:mask="0xff" edc:name="PR2" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2CON" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T2CON" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x1C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OUTPS" edc:desc="" edc:mask="0xf" edc:name="OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x7" edc:name="CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2OUTPS" edc:desc="" edc:mask="0xf" edc:name="T2OUTPS" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="T2CKPS" edc:desc="" edc:mask="0x7" edc:name="T2CKPS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="T2ON" edc:desc="" edc:mask="0x1" edc:name="T2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T2OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS0" edc:desc="" edc:mask="0x1" edc:name="T2CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS1" edc:desc="" edc:mask="0x1" edc:name="T2CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPS2" edc:desc="" edc:mask="0x1" edc:name="T2CKPS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OUTPS0" edc:desc="" edc:mask="0x1" edc:name="OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS1" edc:desc="" edc:mask="0x1" edc:name="OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS2" edc:desc="" edc:mask="0x1" edc:name="OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUTPS3" edc:desc="" edc:mask="0x1" edc:name="OUTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:desc="" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:desc="" edc:mask="0x1" edc:name="CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPS2" edc:desc="" edc:mask="0x1" edc:name="CKPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2ON" edc:desc="" edc:mask="0x1" edc:name="TMR2ON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T2HLT" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="T2HLT" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x1D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x1f" edc:name="MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="CKSYNC" edc:desc="" edc:mask="0x1" edc:name="CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CKPOL" edc:desc="" edc:mask="0x1" edc:name="CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSYNC" edc:desc="" edc:mask="0x1" edc:name="PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE4" edc:mask="0x1" edc:name="MODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2MODE" edc:desc="" edc:mask="0x1f" edc:name="T2MODE" edc:nzwidth="5"/>
              <edc:SFRFieldDef edc:cname="T2CKSYNC" edc:desc="" edc:mask="0x1" edc:name="T2CKSYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKPOL" edc:desc="" edc:mask="0x1" edc:name="T2CKPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2PSYNC" edc:desc="" edc:mask="0x1" edc:name="T2PSYNC" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2MODE0" edc:desc="" edc:mask="0x1" edc:name="T2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE1" edc:desc="" edc:mask="0x1" edc:name="T2MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE2" edc:desc="" edc:mask="0x1" edc:name="T2MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE3" edc:desc="" edc:mask="0x1" edc:name="T2MODE3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2MODE4" edc:mask="0x1" edc:name="T2MODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="T2CLKCON" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="T2CLKCON" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x1E">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="T2CLK"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:mask="0xf" edc:name="CS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2CS" edc:mask="0xf" edc:name="T2CS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2CS0" edc:mask="0x1" edc:name="T2CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS1" edc:mask="0x1" edc:name="T2CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS2" edc:mask="0x1" edc:name="T2CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2CS3" edc:mask="0x1" edc:name="T2CS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="T2RST" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="T2RST" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-02777_tmr_mid2_v2_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x1F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSEL" edc:mask="0x1f" edc:name="RSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RSEL0" edc:mask="0x1" edc:name="RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL1" edc:mask="0x1" edc:name="RSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL2" edc:mask="0x1" edc:name="RSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL3" edc:mask="0x1" edc:name="RSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RSEL4" edc:mask="0x1" edc:name="RSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T2RSEL" edc:mask="0x1f" edc:name="T2RSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="T2RSEL0" edc:mask="0x1" edc:name="T2RSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL1" edc:mask="0x1" edc:name="T2RSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL2" edc:mask="0x1" edc:name="T2RSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL3" edc:mask="0x1" edc:name="T2RSEL3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2RSEL4" edc:mask="0x1" edc:name="T2RSEL4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="1" edc:beginaddr="0x80" edc:endaddr="0xA0" edc:regionid="sfr1">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0x80"/>
        <edc:SFRDef edc:access="--nnrnnn" edc:cname="TRISA" edc:desc="PORTA Data Direction Control Register" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="TRISA" edc:nzwidth="0x8" edc:por="--111111" edc:_addr="0x8C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISA0" edc:desc="" edc:mask="0x1" edc:name="TRISA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA1" edc:desc="" edc:mask="0x1" edc:name="TRISA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA2" edc:desc="" edc:mask="0x1" edc:name="TRISA2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRISA4" edc:desc="" edc:mask="0x1" edc:name="TRISA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISA5" edc:desc="" edc:mask="0x1" edc:name="TRISA5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn----" edc:cname="TRISB" edc:desc="" edc:impl="0xf0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111----" edc:name="TRISB" edc:nzwidth="8" edc:por="1111----" edc:_addr="0x8D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRISB4" edc:desc="" edc:mask="0x1" edc:name="TRISB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB5" edc:desc="" edc:mask="0x1" edc:name="TRISB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB6" edc:desc="" edc:mask="0x1" edc:name="TRISB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISB7" edc:desc="" edc:mask="0x1" edc:name="TRISB7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TRISC" edc:desc="PORTC Data Direction Control Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="TRISC" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0x8E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISC0" edc:desc="" edc:mask="0x1" edc:name="TRISC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC1" edc:desc="" edc:mask="0x1" edc:name="TRISC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC2" edc:desc="" edc:mask="0x1" edc:name="TRISC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC3" edc:desc="" edc:mask="0x1" edc:name="TRISC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC4" edc:desc="" edc:mask="0x1" edc:name="TRISC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC5" edc:desc="" edc:mask="0x1" edc:name="TRISC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISC6" edc:desc="" edc:mask="0x1" edc:name="TRISC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISC7" edc:desc="" edc:mask="0x1" edc:name="TRISC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x8F"/>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x90"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE1" edc:desc="Peripheral Interrupt Enable Register 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE1" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0x91">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1IE" edc:desc="TMR1 Overflow Interrupt Enable bit" edc:mask="0x1" edc:name="TMR1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR2IE" edc:desc="TMR2 to PR2 Match Interrupt Enable bit" edc:mask="0x1" edc:name="TMR2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IE" edc:desc="" edc:mask="0x1" edc:name="CCP1IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1IE" edc:desc="" edc:mask="0x1" edc:name="SSP1IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXIE" edc:desc="" edc:mask="0x1" edc:name="TXIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RCIE" edc:desc="" edc:mask="0x1" edc:name="RCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADIE" edc:desc="A/D Converter Interrupt Enable bit" edc:mask="0x1" edc:name="ADIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIE" edc:desc="Timer1 Gate Interrupt Enable bit" edc:mask="0x1" edc:name="TMR1GIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CCPIE" edc:desc="" edc:mask="0x1" edc:name="CCPIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-nnnn" edc:cname="PIE2" edc:desc="Peripheral Interrupt Enable Register 2" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="PIE2" edc:nzwidth="0x8" edc:por="000-0000" edc:_addr="0x92">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2IE" edc:desc="" edc:mask="0x1" edc:name="CCP2IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C3IE" edc:desc="" edc:mask="0x1" edc:name="C3IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C4IE" edc:desc="" edc:mask="0x1" edc:name="C4IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BCL1IE" edc:desc="" edc:mask="0x1" edc:name="BCL1IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="C1IE" edc:desc="" edc:mask="0x1" edc:name="C1IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2IE" edc:desc="" edc:mask="0x1" edc:name="C2IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OSFIE" edc:desc="" edc:mask="0x1" edc:name="OSFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE3" edc:desc="Peripheral Interrupt Enable Register 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE3" edc:nzwidth="8" edc:por="00000000" edc:_addr="0x93">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLC1IE" edc:desc="" edc:mask="0x1" edc:name="CLC1IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC2IE" edc:desc="" edc:mask="0x1" edc:name="CLC2IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CLC3IE" edc:desc="" edc:mask="0x1" edc:name="CLC3IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COG2IE" edc:desc="" edc:mask="0x1" edc:name="COG2IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ZCDIE" edc:desc="" edc:mask="0x1" edc:name="ZCDIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COGIE" edc:desc="" edc:mask="0x1" edc:name="COGIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5IE" edc:desc="" edc:mask="0x1" edc:name="PWM5IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6IE" edc:desc="" edc:mask="0x1" edc:name="PWM6IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="PIE4" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="PIE4" edc:nzwidth="8" edc:por="--000000" edc:_addr="0x94">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR4IE" edc:desc="" edc:mask="0x1" edc:name="TMR4IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6IE" edc:desc="" edc:mask="0x1" edc:name="TMR6IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3IE" edc:desc="" edc:mask="0x1" edc:name="TMR3IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3GIE" edc:desc="" edc:mask="0x1" edc:name="TMR3GIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5IE" edc:desc="" edc:mask="0x1" edc:name="TMR5IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5GIE" edc:desc="" edc:mask="0x1" edc:name="TMR5GIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPTION_REG" edc:desc="Option Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="OPTION_REG" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0x95">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x7" edc:name="PS" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="PSA" edc:desc="Prescaler Active bit" edc:mask="0x1" edc:name="PSA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0SE" edc:desc="TMR0 Source Edge Select bit" edc:mask="0x1" edc:name="TMR0SE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0CS" edc:desc="" edc:mask="0x1" edc:name="TMR0CS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTEDG" edc:desc="Interrupt Edge Select bit" edc:mask="0x1" edc:name="INTEDG" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="nWPUEN" edc:desc="Weak Pull-up Enable bit" edc:mask="0x1" edc:name="nWPUEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="" edc:mask="0x1" edc:name="PS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T0SE" edc:desc="" edc:mask="0x1" edc:name="T0SE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T0CS" edc:desc="" edc:mask="0x1" edc:name="T0CS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
