garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1769.PIC
        <edc:SFRDef edc:access="n-rnnn--" edc:cname="PWM5CON" edc:desc="" edc:impl="0xbc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0000--" edc:name="PWM5CON" edc:nzwidth="8" edc:por="0-0000--" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD9B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x3" edc:name="MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="POL" edc:desc="" edc:mask="0x1" edc:name="POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM5MODE0" edc:desc="" edc:mask="0x1" edc:name="PWM5MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5MODE1" edc:desc="" edc:mask="0x1" edc:name="PWM5MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PWM5MODE" edc:desc="" edc:mask="0x3" edc:name="PWM5MODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="PWM5POL" edc:desc="" edc:mask="0x1" edc:name="PWM5POL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5OUT" edc:desc="" edc:mask="0x1" edc:name="PWM5OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM5EN" edc:desc="" edc:mask="0x1" edc:name="PWM5EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM5INTE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM5INTE" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD9C">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM5INTCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRIE" edc:desc="" edc:mask="0x1" edc:name="PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DCIE" edc:desc="" edc:mask="0x1" edc:name="DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHIE" edc:desc="" edc:mask="0x1" edc:name="PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFIE" edc:desc="" edc:mask="0x1" edc:name="OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM5PRIE" edc:desc="" edc:mask="0x1" edc:name="PWM5PRIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5DCIE" edc:desc="" edc:mask="0x1" edc:name="PWM5DCIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5PHIE" edc:desc="" edc:mask="0x1" edc:name="PWM5PHIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5OFIE" edc:desc="" edc:mask="0x1" edc:name="PWM5OFIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----cccc" edc:cname="PWM5INTF" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM5INTF" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD9D">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="PWM5INTFLG"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRIF" edc:desc="" edc:mask="0x1" edc:name="PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DCIF" edc:desc="" edc:mask="0x1" edc:name="DCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PHIF" edc:desc="" edc:mask="0x1" edc:name="PHIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OFIF" edc:desc="" edc:mask="0x1" edc:name="OFIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM5PRIF" edc:desc="" edc:mask="0x1" edc:name="PWM5PRIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5DCIF" edc:desc="" edc:mask="0x1" edc:name="PWM5DCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5PHIF" edc:desc="" edc:mask="0x1" edc:name="PWM5PHIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5OFIF" edc:desc="" edc:mask="0x1" edc:name="PWM5OFIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn--nn" edc:cname="PWM5CLKCON" edc:desc="" edc:impl="0x73" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000--00" edc:name="PWM5CLKCON" edc:nzwidth="8" edc:por="-000--00" edc:_modsrc="DOS-02423_pwm_16bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0xD9E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3" edc:name="CS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x7" edc:name="PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PWM5CS0" edc:desc="" edc:mask="0x1" edc:name="PWM5CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5CS1" edc:desc="" edc:mask="0x1" edc:name="PWM5CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5CS2" edc:desc="" edc:mask="0x1" edc:name="PWM5CS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM5PS0" edc:desc="" edc:mask="0x1" edc:name="PWM5PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5PS1" edc:desc="" edc:mask="0x1" edc:name="PWM5PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM5PS2" edc:desc="" edc:mask="0x1" edc:name="PWM5PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="PWM5CS" edc:desc="" edc:mask="0x7" edc:name="PWM5CS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM5PS" edc:desc="" edc:mask="0x7" edc:name="PWM5PS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:desc="" edc:mask="0x1" edc:name="CS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="" edc:mask="0x1" edc:name="PS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="" edc:mask="0x1" edc:name="PS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="" edc:mask="0x1" edc:name="PS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
