garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16LF1769.PIC
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC1PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC1PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xEA1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC1PPS" edc:desc="" edc:mask="0x1f" edc:name="RC1PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC2PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC2PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xEA2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC2PPS" edc:desc="" edc:mask="0x1f" edc:name="RC2PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC3PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC3PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xEA3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC3PPS" edc:desc="" edc:mask="0x1f" edc:name="RC3PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC4PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC4PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xEA4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC4PPS" edc:desc="" edc:mask="0x1f" edc:name="RC4PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC5PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC5PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xEA5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC5PPS" edc:desc="" edc:mask="0x1f" edc:name="RC5PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC6PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC6PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xEA6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC6PPS" edc:desc="" edc:mask="0x1f" edc:name="RC6PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="RC7PPS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="RC7PPS" edc:nzwidth="8" edc:por="---00000" edc:_addr="0xEA7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC7PPS" edc:desc="" edc:mask="0x1f" edc:name="RC7PPS" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="30" edc:beginaddr="0xf00" edc:endaddr="0xf70" edc:regionid="sfr30">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF00"/>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0xF0C"/>
        <edc:SFRDef edc:access="-----rrr" edc:cname="CLCDATA" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CLCDATA" edc:nzwidth="8" edc:por="-----000" edc:_addr="0xF0F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MCLC1OUT" edc:desc="" edc:mask="0x1" edc:name="MCLC1OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MCLC2OUT" edc:desc="" edc:mask="0x1" edc:name="MCLC2OUT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MCLC3OUT" edc:desc="" edc:mask="0x1" edc:name="MCLC3OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CLC1CON" edc:desc="Configurable logic cell control" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CLC1CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF10">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC1MODE" edc:desc="" edc:mask="0x7" edc:name="LC1MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="LC1INTN" edc:desc="" edc:mask="0x1" edc:name="LC1INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1INTP" edc:desc="" edc:mask="0x1" edc:name="LC1INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1OUT" edc:desc="" edc:mask="0x1" edc:name="LC1OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LC1EN" edc:desc="" edc:mask="0x1" edc:name="LC1EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="LC1MODE0" edc:desc="" edc:mask="0x1" edc:name="LC1MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1MODE1" edc:desc="" edc:mask="0x1" edc:name="LC1MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC1MODE2" edc:desc="" edc:mask="0x1" edc:name="LC1MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x7" edc:name="MODE" edc:nzwidth="3"/>
              <edc:SFRFieldDef edc:cname="INTN" edc:desc="" edc:mask="0x1" edc:name="INTN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INTP" edc:desc="" edc:mask="0x1" edc:name="INTP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
